Autodesk.Revit.DB.ElementIdSetFilter.#ctor(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Constructs a new instance of a filter wrapping a set of elements.
idsToInclude:
The ids.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input collection of ids was empty, or its contents were not valid for iteration.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021